docs/leets/0143-Reorder-List.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0143. Reorder List</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-05-21
</div>
<div id="content" class="content">
<header>
<h1 class="title">0143. Reorder List</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org85a0adf">Problem Overview</a></li>
<li><a href="#org7aaf477">Solution Outline</a></li>
<li><a href="#orgad5d4ed">Plan</a></li>
<li><a href="#org68b94e2">Initial Setup and Test Cases</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org85a0adf" class="outline-2">
<h2 id="org85a0adf">Problem Overview</h2>
<div class="outline-text-2" id="text-org85a0adf">
<p>
The problem "Reorder List" requires us to reorder a singly linked list such that the nodes are arranged in a specific pattern. Specifically, given a list `L0 → L1 → … → Ln-1 → Ln`, we need to transform it to `L0 → Ln → L1 → Ln-1 → L2 → Ln-2 → …`.
</p>
</div>
</div>

<div id="outline-container-org7aaf477" class="outline-2">
<h2 id="org7aaf477">Solution Outline</h2>
<div class="outline-text-2" id="text-org7aaf477">
<ul class="org-ul">
<li><b><b>Preferred Structure:</b></b> Linked List.</li>
<li><b><b>Brute Force vs Optimal Solution:</b></b> The brute force approach would involve iterating through the list multiple times to rearrange the nodes. The optimal solution involves using a two-pointer technique and list reversal.</li>
<li><b><b>Algorithm Choice:</b></b> The most suitable algorithm involves:
<ol class="org-ol">
<li>Finding the middle of the linked list.</li>
<li>Reversing the second half of the list.</li>
<li>Merging the two halves in the required order.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgad5d4ed" class="outline-2">
<h2 id="orgad5d4ed">Plan</h2>
<div class="outline-text-2" id="text-orgad5d4ed">
<ol class="org-ol">
<li><b><b>Find the Middle:</b></b> Use the slow and fast pointer technique to find the middle node of the linked list.</li>
<li><b><b>Reverse the Second Half:</b></b> Reverse the second half of the linked list.</li>
<li><b><b>Merge the Two Halves:</b></b> Merge the two halves, alternating nodes from each half.</li>
</ol>
</div>
</div>

<div id="outline-container-org68b94e2" class="outline-2">
<h2 id="org68b94e2">Initial Setup and Test Cases</h2>
<div class="outline-text-2" id="text-org68b94e2">
<div class="org-src-container">
<pre class="src src-js">/**
 * Definition for singly-linked list.
 * function ListNode(val, next) {
 *     this.val = (val===undefined ? 0 : val)
 *     this.next = (next===undefined ? null : next)
 * }
 */

/**
 * Function to reorder the list
 * @param {ListNode} head - The head of the linked list
 */
function reorderList(head) {
  if (!head || !head.next) return;

  // Helper 
  function printList(head) {
      const result = [];
      let current = head;
      while (current) {
          result.push(current.val);
          current = current.next;
      }
      return result;
  }

  // mid
  function findMid(h) {
      let slow = h;
      let fast = h.next;
      while (fast &amp;&amp; fast.next) {
          slow = slow.next;
          fast = fast.next.next;
      }
      return slow;
  }

  let mid = findMid(head);
  let secondHalf = mid.next;
  mid.next = null;

  // rev
  function reverseMid(mid) {
      let prev = null;
      let cur = mid;
      while (cur) {
          let next = cur.next;
          cur.next = prev;
          prev = cur;
          cur = next;
      }
      return prev;
  }

  let head2 = reverseMid(secondHalf);

  // zip
  function zip(first, second) {
      while (second) {
          let temp1 = first.next;
          let temp2 = second.next;
          first.next = second;
          second.next = temp1;
          first = temp1;
          second = temp2;
      }
  }

  zip(head, head2);
}

// Test cases
const testCases = [
    { head: [1,2,3,4], expected: [1,4,2,3] },
    { head: [1,2,3,4,5], expected: [1,5,2,4,3] },
];

function ListNode(val, next) {
    this.val = (val===undefined ? 0 : val)
    this.next = (next===undefined ? null : next)
}


// Function to print list nodes for testing
function printList(head) {
    const result = [];
    let current = head;
    while (current) {
        result.push(current.val);
        current = current.next;
    }
    return result;
}

// Helper function to create linked list from array
function createLinkedList(arr) {
    let dummy = new ListNode(0);
    let current = dummy;
    for (const val of arr) {
        current.next = new ListNode(val);
        current = current.next;
    }
    return dummy.next;
}

testCases.forEach((test, index) =&gt; {
    const head = createLinkedList(test.head);
    reorderList(head);
    const result = printList(head);
    console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
